#!/usr/bin/env python 
# -*- coding:utf-8 -*-
#########################################################
#   File name:  .py
#      Author:  钟东佐
#        Date:  2020//
#    describe:
#########################################################


# /////////////////////////////////////////////////////////////////////////////////////////
# ############################### 函数说明 ###############################
#
# ########################################################################
# ################################################# 常数值设定区域 #################################################

# ##################################################################################################################

# \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\

"""
该模块主要处理对于药板的拿和放的控制
Parameters
----------
Returns
-------
Raises
------
"""

# 初始化设定
def setup():
    return True


# 循环部分
def loop():
    while True:
        return


# 结束释放
def destroy():
    return


# 如果该程序为主程序，程序在此开始运行，若不是不运行，该文件只做函数定义
if __name__ == '__main__':  # Program start from here
    setup_return = setup()
    if setup_return:
        print('始化成功')
    try:
        loop()
    except KeyboardInterrupt:  # 当按下 'Ctrl+C', 子函数 destroy()将会运行，用于停止退出
        print("程序已停止退出...")
        destroy()
